Revit 2027 API
BuiltInFailures.ConversionFailures.CannotConvertTempToDouble Property
 Cannot convert temperature '[Temperate Value]' to double value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConvertTempToDouble { get; }
Public Shared ReadOnly Property CannotConvertTempToDouble As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConvertTempToDouble {
	FailureDefinitionId^ get ();
}
static member CannotConvertTempToDouble : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace